
string1 = input()
string2 = input()
if (string1 == str and string1 == str) and (string1 == string2):
    print('вернуть 1')
elif len(string1) > len(string1):
    print('вернуть 2')
elif string1 !=string2 and string2 == "learn":
    print('вернуть 3')
else:
    print('вернуть 0')



#Условный оператор: Сравнение строк
# Написать функцию, которая принимает на вход две строки
# Проверить, является ли то, что передано функции, строками.
# Если нет - вернуть 0
# Если строки одинаковые, вернуть 1
# Если строки разные и первая длиннее, вернуть 2
# Если строки разные и вторая строка 'learn', возвращает 3
# Вызвать функцию несколько раз, передавая ей разные праметры
# и выводя на экран результаты
