a= int (input())
if (0 >= a) or (a <= 7):
    print("учиться в детском саду")
elif (8 >= a) or (a <= 18):
    print("учиться в школе")
elif (18 >= a) or (a <= 22):
    print("учиться в ВУЗе")
else:
    print("работает")




#"""Домашнее задание №1
#Условный оператор: Возраст#
# Попросить пользователя ввести возраст при помощи input и положить#
  #результат в переменную#
#Написать функцию, которая по возрасту определит, чем должен заниматься пользователь:
#учиться в детском саду, школе, ВУЗе или работать
#Вызвать функцию, передав ей возраст пользователя и положить результат
 # работы функции в переменную
#Вывести содержимое переменной на экран#
